cleanli2/stm32f407ve/Core/Src/lcd_nt35510.c
		//## Gate EQ:
		LCD_WR_REG(0xB700); LCD_WR_DATA(0x00);
		LCD_WR_REG(0xB701); LCD_WR_DATA(0x00);

		//## Source EQ:
		LCD_WR_REG(0xB800); LCD_WR_DATA(0x01);
		LCD_WR_REG(0xB801); LCD_WR_DATA(0x05);
		LCD_WR_REG(0xB802); LCD_WR_DATA(0x05);
		LCD_WR_REG(0xB803); LCD_WR_DATA(0x05);

		//# Inversion: Column inversion (NVT)
		LCD_WR_REG(0xBC00); LCD_WR_DATA(0x00);
		LCD_WR_REG(0xBC01); LCD_WR_DATA(0x00);
		LCD_WR_REG(0xBC02); LCD_WR_DATA(0x00);

		//# BOE's Setting(default)
		LCD_WR_REG(0xCC00); LCD_WR_DATA(0x03);
		LCD_WR_REG(0xCC01); LCD_WR_DATA(0x00);
		LCD_WR_REG(0xCC02); LCD_WR_DATA(0x00);

		//# Display Timing:
		LCD_WR_REG(0xBD00); LCD_WR_DATA(0x01);
		LCD_WR_REG(0xBD01); LCD_WR_DATA(0x84);
		LCD_WR_REG(0xBD02); LCD_WR_DATA(0x07);
		LCD_WR_REG(0xBD03); LCD_WR_DATA(0x31);
		LCD_WR_REG(0xBD04); LCD_WR_DATA(0x00);

		LCD_WR_REG(0xBA00); LCD_WR_DATA(0x01);

		LCD_WR_REG(0xFF00); LCD_WR_DATA(0xAA);
		LCD_WR_REG(0xFF01); LCD_WR_DATA(0x55);
		LCD_WR_REG(0xFF02); LCD_WR_DATA(0x25);
		LCD_WR_REG(0xFF03); LCD_WR_DATA(0x01);

		LCD_WR_REG(0x3500); LCD_WR_DATA(0x00);
		LCD_WR_REG(0x3600); LCD_WR_DATA(0x00);
		LCD_WR_REG(0x3a00); LCD_WR_DATA(0x55);  ////55=16?/////66=18?
		LCD_WR_REG(0x1100);
		delay_ms(120); 
		LCD_WR_REG(0x2900 ); 
		LCD_WR_REG(0x2c00);
	#if LCD_USE8BIT_MODEL	 //8位模式下，LCD初始化两遍，防止reset或者断电重启后，显示异常
	if(init_flag==0)
	{
		init_flag=1;
		goto Init;
	}
	#endif
  LCD_direction(1);//设置LCD显示方向

	LCD_LED_ON;//点亮背光	 
	LCD_Clear(WHITE);//清全屏白色
}
 
/*****************************************************************************
 * @name       :void LCD_SetWindows(u16 xStar, u16 yStar,u16 xEnd,u16 yEnd)
 * @date       :2018-08-09 
 * @function   :Setting LCD display window
 * @parameters :xStar:the bebinning x coordinate of the LCD display window
								yStar:the bebinning y coordinate of the LCD display window
								xEnd:the endning x coordinate of the LCD display window
								yEnd:the endning y coordinate of the LCD display window
 * @retvalue   :None
******************************************************************************/ 
void LCD_SetWindows(u16 xStar, u16 yStar,u16 xEnd,u16 yEnd)
{	
	LCD_WR_REG(lcddev.setxcmd);LCD_WR_DATA(xStar>>8);  
	LCD_WR_REG(lcddev.setxcmd+1);LCD_WR_DATA(xStar&0XFF);	  
	LCD_WR_REG(lcddev.setxcmd+2);LCD_WR_DATA(xEnd>>8);   
	LCD_WR_REG(lcddev.setxcmd+3);LCD_WR_DATA(xEnd&0XFF);   
	LCD_WR_REG(lcddev.setycmd);LCD_WR_DATA(yStar>>8);   
	LCD_WR_REG(lcddev.setycmd+1);LCD_WR_DATA(yStar&0XFF);  
	LCD_WR_REG(lcddev.setycmd+2);LCD_WR_DATA(yEnd>>8);   
	LCD_WR_REG(lcddev.setycmd+3);LCD_WR_DATA(yEnd&0XFF); 

	LCD_WriteRAM_Prepare();	//开始写入GRAM			
}   

void color16_lcd(u16 color, u32 n);
void lcd_clr_window(u16 color, u16 xs, u16 ys, u16 xe, u16 ye)
{
	LCD_SetWindows(xs,ys,xe,ye);   
    color16_lcd(color, ((unsigned int)xe-xs+1)*(ye-ys+1));
#if 0
	for(u32 i=0;i<total_point;i++)
	{ 
		LCD->LCD_RAM = color;
	}
#endif
}
/*****************************************************************************
 * @name       :void LCD_SetCursor(u16 Xpos, u16 Ypos)
 * @date       :2018-08-09 
 * @function   :Set coordinate value
 * @parameters :Xpos:the  x coordinate of the pixel
								Ypos:the  y coordinate of the pixel
 * @retvalue   :None
******************************************************************************/ 
void LCD_SetCursor(u16 Xpos, u16 Ypos)
{	  	    			
	LCD_SetWindows(Xpos,Ypos,Xpos,Ypos);	
} 

/*****************************************************************************
 * @name       :void LCD_direction(u8 direction)
 * @date       :2018-08-09 
 * @function   :Setting the display direction of LCD screen
 * @parameters :direction:0-0 degree
                          1-90 degree
													2-180 degree
													3-270 degree
 * @retvalue   :None
******************************************************************************/ 
void LCD_direction(u8 direction)
{ 
	lcddev.setxcmd=0x2A00;
	lcddev.setycmd=0x2B00;
	lcddev.wramcmd=0x2C00;
	lcddev.rramcmd=0x2E00;
	switch(direction){		  
		case 0:						 	 		
			lcddev.width=LCD_W;
			lcddev.height=LCD_H;		
			LCD_WriteReg(0x3600,0x00);
		break;
		case 1:
			lcddev.width=LCD_H;
			lcddev.height=LCD_W;
			LCD_WriteReg(0x3600,(1<<5)|(1<<6));
		break;
		case 2:						 	 		
			lcddev.width=LCD_W;
			lcddev.height=LCD_H;	
			LCD_WriteReg(0x3600,(1<<7)|(1<<6));
		break;
		case 3:
			lcddev.width=LCD_H;
			lcddev.height=LCD_W;
			LCD_WriteReg(0x3600,(1<<7)|(1<<5));
		break;	
		default:break;
	}		
}	 

/*****************************************************************************
 * @name       :u16 LCD_Read_ID(void)
 * @date       :2018-11-13 
 * @function   :Read ID
 * @parameters :None
 * @retvalue   :ID value
******************************************************************************/ 
u16 LCD_Read_ID(void)
{
	u16 val;
	LCD_WR_REG(0xF000);
	LCD_WR_DATA(0x55);
	LCD_WR_REG(0xF001);
	LCD_WR_DATA(0xAA);
	LCD_WR_REG(0xF002);
	LCD_WR_DATA(0x52);
	LCD_WR_REG(0xF003);
	LCD_WR_DATA(0x08);
	LCD_WR_REG(0xF004);
	LCD_WR_DATA(0x01);

    LCD_ReadReg(0xC500,&lcddev.id,1);//读回0X55
	lcddev.id<<=8;
	LCD_ReadReg(0xC501,&val,1);//读回0X10	
	lcddev.id |= val;
	return lcddev.id;
}
